app/controllers/api/artworks_controller.rb

    def create
        @artwork = Artwork.new(artwork_params)
        if @artwork.save
---
INSERT INTO "artworks" ("title", "description", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

    def update
        @artwork = Artwork.find(params[:id])
        if @artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = ?, "description" = ?, "url" = ?, "updated_at" = ? WHERE "artworks"."id" = ?

    def destroy
        @artwork = Artwork.find(params[:id])
        if @artwork.destroy
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = ?  [["id", 2]]